<?php
/* 10000 - 19999*/
return [
    -6 => '该名称已经被占用，请重新输入！',
    -5 => '该记录不存在！',
    -4 => '该记录已存在，请重新输入！',
    -3 => '中国IP禁止登陆|400',
    -2 => '操作失败|400',
    -1 => '程序调试',
    0 => '操作成功|200',
    1 => '登录成功|200',
    2 => '退出成功|200',
    3 => '参数不能为空',
    4 => '账号或密码错误',
    5 => '账号已被停用',
    6 => 'IP已被限制登录',
    7 => '参数不能为空',
    8 => '已有相同数据',
    9 => '用户不存在',
    10 => 'id不能为空',
    12 => '请先删除支付通道',
    13 => '请叫技术先对该渠道配置模板',
    14 => '已存在该支付类型通道',
    15 => '你的操作过于频繁，请稍候再试',
    20 => '该厅主该渠道回调IP白名单已存在',
    25 => '开始时间不能大于结束时间！',
    30 => '上传失败',
    31 => '缺少参数或参数错误|400',
    32 => '不存在数据！|400',
    100 => '客户不存在!',
    101 => '获取数据失败！',
    120 => '第三方未有提供汇总查询！',
    121 => '图形验证码错误，请重新输入！|400',
    886 => '%s',
    122 => 'The information has not been modified, please edit again!',
    123 => '删除失败!',
    124 => '',
    125 => '',
    126 => '记录不存在!',
    127 => '记录已存在!',
    128 => '日志所需的必要参数非法!',
    129 => '写入日志记录失败!',
    130 => '更新管理员信息失败!',
    131 => '请求数据不合法!',
    132 => '新增记录失败!',
    133 => '品牌名称已存在!',
    134 => '代理号不存在!',
    135 => '该记录已存在且状态为：已下架!',
    136 => '代理账户游戏账户已存在!',
    137 => '用户已存在!',
    138 => '代号编号不能为空!',
    139 => '更新记录失败!',
    140 => '新增账户角色权限关系记录失败!',
    141 => '删除账户详情失败!',
    142 => '删除账户角色权限关系记录失败!',
    143 => '账户密码不能为空!',
    144 => 'ip不合法!',
    145 => '更新账户角色权限关系记录失败!',
    146 => '参数非法!',
    150 => '代理帐号状态已被禁用!',
    151 => '厂商子代理API末配置',
    152 => 'Merchant wallet not created',

    /**转账记录*/
    160 => 'The order status is not in progress',
    161 => 'The bill of lading was not found',
    /**转账记录*/

    /**第三方支付*/
    170 => 'payment type already exists',
    /**第三方支付*/

    /**用户修改密码相关**/
    180 => 'this user does not exist',
    181 => 'old password error',
    /**用户修改密码相关**/

    /**管理员相关**/
    190 => 'Merchant role does not exist, please create it first',
    /**管理员相关**/

    /**订单相关**/
    200 => 'order not exist',
    201 => 'The order is already in dispute',
    202 => 'The dispute resolution for this order has been resolved',
    203 => 'The voucher for this order has been uploaded',
    /**订单相关**/

    /**上传相关**/
    10010 => 'Missing or incorrect parameter',
    10015 => 'data does not exist！',
    11022 => "uploaded file size doesn't match",
    11023 => "uploaded file suffix doesn't match",
    /**上传相关**/

];